{
  "title": "Introduction to Pedro Pathing",
  "sections": [
    {
      "type": "text",
      "title": "What is Pedro Pathing?",
      "content": "Pedro Pathing is an advanced Reactive Vector Follower developed by FTC Team 10158 that revolutionizes autonomous navigation in robotics. Unlike conventional pathing systems such as Road Runner, Pedro Pathing leverages Bézier curve generation to produce smoother, faster, and more efficient trajectories. Its primary focus is on enhancing the adaptability of robots during autonomous operation by reacting dynamically to environmental changes."
    },
    {
      "type": "text",
      "title": "Key Advantages of Pedro Pathing",
      "content": "Pedro Pathing offers several significant advantages over traditional pathing systems. By incorporating Bézier curves, the system provides smoother transitions for precision-intensive tasks, faster execution by reducing time spent in path planning, and dynamic adjustments that allow the robot to react to obstacles or changes in the environment in real-time."
    },
    {
      "type": "list",
      "title": "Why Choose Pedro Pathing?",
      "content": [
        "Smoother Transitions: Ensures less jerky motions for precision-intensive tasks",
        "Faster Execution: Reduces time spent in path planning and execution",
        "Dynamic Adjustments: Reacts to obstacles or changes in the environment in real-time",
        "Advanced Bézier Curve Generation: Produces more efficient trajectories than traditional pathing systems"
      ]
    },
    {
      "type": "text",
      "title": "Prerequisites and Requirements",
      "content": "Pedro Pathing is designed to work with omnidirectional drives, such as mecanum drive. Currently, there is no support for swerve drives. You'll need a robot with mecanum wheels or similar omnidirectional drive system to use Pedro Pathing effectively."
    },
    {
      "type": "list",
      "title": "Getting Started with Pedro Pathing",
      "content": [
        "Clone the <a href=\"https://github.com/Pedro-Pathing/Quickstart.git\" target=\"_blank\">Pedro Pathing Quickstart</a> project for the easiest setup",
        "Add the required repositories to your <code>build.dependencies.gradle</code> file",
        "Add Pedro Pathing dependencies to your project",
        "Create a <code>pedroPathing</code> package in your project",
        "Download and add the tuners from the quickstart project",
        "Set up your constants files for configuration"
      ]
    },
    {
      "type": "code",
      "title": "Adding Pedro Pathing to Your Project",
      "content": "If you want to add Pedro Pathing to an existing project, you'll need to update your Gradle files:",
      "code": "// Add to repositories block in build.dependencies.gradle\nrepositories {\n    maven { url = 'https://maven.brott.dev/' }\n    maven { url = 'https://maven.pedropathing.com/' }\n}\n\n// Add to dependencies block\ndependencies {\n    implementation 'com.pedropathing:pedro:[VERSION]'\n    implementation 'com.acmerobotics.dashboard:dashboard:0.4.16'\n}"
    },
    {
      "type": "emphasis-box",
      "title": "Reference",
      "content": "For detailed setup instructions, see the <a href=\"https://pedropathing.com/pedro/prerequisites.html\" target=\"_blank\">Pedro Pathing Prerequisites</a> and <a href=\"https://pedropathing.com/pedro/overview.html\" target=\"_blank\">Pedro Pathing Overview</a>."
    }
  ]
}
