{
  "title": "Pedro Advanced Configuration",
  "sections": [
    {
      "type": "text",
      "title": "PIDF Tuning for Pedro Pathing",
      "content": "PIDF (Proportional, Integral, Derivative, Feedforward) tuning is essential for optimal Pedro Pathing performance. The system uses multiple PID controllers for different aspects of movement: translational movement, heading control, and drive control. Proper tuning ensures smooth, accurate path following with minimal oscillation and overshoot."
    },
    {
      "type": "text",
      "title": "Understanding PIDF Components",
      "content": "Each PIDF component serves a specific purpose in Pedro Pathing. The Proportional term responds to current error, the Integral term accumulates past errors, the Derivative term predicts future errors, and the Feedforward term provides immediate response to setpoint changes. Together, they create a responsive and stable control system."
    },
    {
      "type": "list",
      "title": "PIDF Tuning Process",
      "content": [
        "Start with translational PID tuning to get basic movement control",
        "Tune heading PID to ensure accurate orientation control",
        "Configure drive PID for motor response optimization",
        "Adjust feedforward values for immediate response to commands",
        "Fine-tune centripetal scaling for smooth curve following"
      ]
    },
    {
      "type": "text",
      "title": "Automatic Tuners and Optimization",
      "content": "Pedro Pathing includes automatic tuners that simplify the optimization process. These tuners help you find optimal PID gains and Bézier control points without extensive manual tuning. The tuners run specific tests and automatically adjust parameters based on your robot's performance."
    },
    {
      "type": "code",
      "title": "Using Pedro Pathing Tuners",
      "content": "The Pedro Pathing quickstart includes several tuner op modes. Here's how to use them:",
      "code": "// Example of running a tuner op mode\n@TeleOp(name=\"Translational Tuner\")\npublic class TranslationalTuner extends OpMode {\n    private Follower follower;\n    \n    @Override\n    public void init() {\n        // Initialize your drive system\n        follower = new Follower(hardwareMap);\n    }\n    \n    @Override\n    public void loop() {\n        // The tuner will handle the testing logic\n        // Follow the on-screen instructions to tune your robot\n    }\n}"
    },
    {
      "type": "text",
      "title": "Testing and Validation",
      "content": "After tuning your PIDF controllers, it's crucial to validate the overall performance of your robot under real-world conditions. This ensures that your robot follows paths accurately and smoothly across different scenarios."
    },
    {
      "type": "list",
      "title": "Recommended Tests",
      "content": [
        "Circle Test: Observe the robot's handling of continuous curves",
        "Triangle Test: Evaluate navigation of sharp turns and straight segments",
        "Custom Paths: Test performance in scenarios closer to match conditions",
        "Consistency Tests: Ensure performance across different path types"
      ]
    },
    {
      "type": "text",
      "title": "Fine-Tuning and Troubleshooting",
      "content": "If you notice issues during testing, such as overshooting, slow corrections, or oscillations, you'll need to make small adjustments to your PID values. Alternate between different tests to ensure your robot performs well in diverse scenarios."
    },
    {
      "type": "list",
      "title": "Common Issues and Solutions",
      "content": [
        "Overshooting: Reduce proportional gain or increase derivative gain",
        "Slow Response: Increase proportional gain or feedforward values",
        "Oscillations: Reduce proportional gain or increase derivative gain",
        "Drift: Check localization accuracy and adjust integral gain"
      ]
    },
    {
      "type": "emphasis-box",
      "title": "Reference",
      "content": "For detailed tuning guides and testing procedures, see the <a href=\"https://pedropathing.com/pedro/pidf/test.html\" target=\"_blank\">PIDF Testing Guide</a> and <a href=\"https://pedropathing.com/pedro/overview.html\" target=\"_blank\">Pedro Pathing Overview</a>."
    }
  ]
}
