{
  "title": "Poses, Paths, and Path Planning Theory (FTC)",
  "sections": [
    {
      "type": "text",
      "title": "What is a Pose?",
      "content": "A <b>pose</b> describes a robot's position and orientation on the field. In FTC, a pose is usually represented as (x, y, θ), where x and y are coordinates (in inches or meters) and θ (theta) is the heading (angle) in radians or degrees. Poses are essential for autonomous navigation and path following. <br><br>See: <a href=\"https://gm0.org/en/latest/docs/software/concepts/odometry.html#pose\" target=\"_blank\">gm0: Pose</a>"
    },
    {
      "type": "text",
      "title": "Coordinate Frames and Field Representation",
      "content": "FTC fields use a 2D coordinate system. The origin (0,0) is usually at a field corner, and heading θ is measured from the x-axis. Understanding coordinate frames is crucial for translating between robot-centric and field-centric movement. <br><br>See: <a href=\"https://acme-robotics.gitbook.io/road-runner/tour/coordinate-frame\" target=\"_blank\">Road Runner: Coordinate Frame</a>"
    },
    {
      "type": "text",
      "title": "Path Representations",
      "content": "A <b>path</b> is a sequence of poses or waypoints that the robot should follow. Paths can be straight lines, curves, or splines. Advanced path planners use mathematical functions (like cubic splines or Bezier curves) to generate smooth, continuous paths. <br><br>Paths are used by algorithms to generate reference poses for the robot to follow at each moment in time."
    },
    {
      "type": "text",
      "title": "Why Poses and Paths Matter",
      "content": "By representing the robot's movement as a series of poses along a path, you can plan complex autonomous routines, avoid obstacles, and ensure precise scoring. Path planning is the foundation for advanced autonomous navigation in FTC."
    },
    {
      "type": "link-grid",
      "title": "Further Reading",
      "links": [
        { "title": "gm0: Odometry & Pose Theory", "url": "https://gm0.org/en/latest/docs/software/concepts/odometry.html" },
        { "title": "Road Runner Coordinate Frame", "url": "https://acme-robotics.gitbook.io/road-runner/tour/coordinate-frame" },
        { "title": "Tyler Veness' Controls Engineering in FRC", "url": "https://www.youtube.com/watch?v=JQEa36F91Nw" }
      ]
    }
  ]
} 