{
  "id": "java-intro",
  "title": "Introduction to Java",
  "sections": [
    {
      "type": "text",
      "title": "Welcome to Java Programming",
      "content": "Java is a powerful, object-oriented programming language that's widely used in robotics, web development, mobile apps, and enterprise software. This course will take you from complete beginner to confident Java programmer."
    },
    {
      "type": "text",
      "title": "Why Learn Java?",
      "content": "<ul><li><strong>Robotics:</strong> Java is used in FTC (FIRST Tech Challenge) and many other robotics platforms</li><li><strong>Portability:</strong> Write once, run anywhere - Java works on any device with a JVM</li><li><strong>Object-Oriented:</strong> Learn modern programming concepts that apply to many languages</li><li><strong>Career Opportunities:</strong> Java developers are in high demand</li><li><strong>Large Community:</strong> Extensive libraries and resources available</li></ul>"
    },
    {
      "type": "text",
      "title": "Course Structure",
      "content": "This course is organized into four main sections:<br><br><strong>Java Basics:</strong> Learn fundamental concepts like variables, data types, and basic operations<br><strong>Programming Logic:</strong> Master control structures and decision-making<br><strong>Loops:</strong> Understand iteration and repetition in programs<br><strong>Object-Oriented Programming:</strong> Learn classes, objects, and modern programming techniques"
    },
    {
      "type": "text",
      "title": "Getting Started",
      "content": "To get the most out of this course:<br><br><ul><li>Complete lessons in order - each builds on previous concepts</li><li>Practice with the code examples provided</li><li>Try modifying examples to see how changes affect the output</li><li>Don't rush - take time to understand each concept before moving on</li></ul>"
    },
    {
      "type": "code",
      "title": "Your First Java Program",
      "content": "public class HelloWorld {\n    public static void main(String[] args) {\n        System.out.println(\"Hello, World!\");\n        System.out.println(\"Welcome to Java programming!\");\n    }\n}"
    }
  ]
} 