{
  "title": "FRC Driver Station Setup and Usage",
  "sections": [
    {
      "type": "text",
      "title": "Introduction to FRC Driver Station",
      "content": "The FRC Driver Station is software that runs on your computer and communicates with your robot during matches and testing. It provides the interface for controlling robot modes, viewing robot status, and monitoring telemetry. The Driver Station is part of the FRC Game Tools package, which also includes the roboRIO Imaging Tool and LabVIEW runtime components.<br><br>Understanding how to use Driver Station is essential for testing and competing with your robot. It serves as the primary interface between your team and the robot during operation.<br><br>Learn more: <a href='https://docs.wpilib.org/en/stable/docs/zero-to-robot/step-2/frc-game-tools.html' target='_blank'>WPILib Documentation: Installing the FRC Game Tools</a>"
    },
    {
      "type": "rules-box",
      "title": "Driver Station Capabilities",
      "subtitle": "The Driver Station provides:",
      "items": [
        "Control robot modes (Disabled, Autonomous, Teleop, Test)",
        "Monitor robot status and connection",
        "View robot telemetry and logs",
        "Configure joysticks and gamepads",
        "Display camera streams from robot",
        "Show match timer and FMS status",
        "Emergency stop functionality"
      ]
    },
    {
      "type": "text",
      "title": "System Requirements",
      "content": "Before installing the FRC Game Tools (which includes Driver Station), ensure your computer meets these requirements:<br><br><strong>Operating System:</strong> Windows 10 or higher (Windows 10, 11)<br><strong>CPU Architecture:</strong> x86 CPU required (ARM CPUs are not supported due to LabVIEW dependency)<br><strong>Administrator Access:</strong> Required for installation<br><strong>Internet Connection:</strong> Required for downloading components (unless using offline installer)<br><br><strong>Important:</strong> FRC Game Tools requires an x86 CPU due to its dependency on LabVIEW. Do not use a device with an ARM CPU (such as some Surface devices or newer Macs with Apple Silicon)."
    },
    {
      "type": "text",
      "title": "Installing FRC Game Tools",
      "content": "The FRC Driver Station is installed as part of the FRC Game Tools package. The Game Tools installer includes:<br><br>- <strong>LabVIEW Update:</strong> Runtime components required for Driver Station and Imaging Tool<br>- <strong>FRC Driver Station:</strong> The main software for controlling your robot<br>- <strong>FRC roboRIO Imaging Tool and Images:</strong> Tools for imaging your roboRIO<br><br><strong>Download Location:</strong> Navigate to the <a href='https://www.ni.com/en-us/support/downloads/software-products/download.frc-game-tools.html' target='_blank'>FRC Game Tools from NI</a><br><br><strong>Installation Options:</strong><br>- <strong>Online Installer:</strong> Downloads components during installation (requires internet)<br>- <strong>Offline Installer:</strong> ISO file containing all components (useful for installing on multiple machines without internet)<br><br>Learn more: <a href='https://docs.wpilib.org/en/stable/docs/zero-to-robot/step-2/frc-game-tools.html' target='_blank'>WPILib Documentation: Installing the FRC Game Tools</a>"
    },
    {
      "type": "text",
      "title": "Uninstalling Old Versions",
      "content": "Before installing a new version of FRC Game Tools, it's recommended to uninstall any old versions, especially when installing a new season's tools.<br><br><strong>When to Uninstall:</strong><br>- Installing a new year's tools (e.g., uninstall 2024 tools before installing 2025 tools)<br>- When a beta version was previously installed<br><br><strong>When NOT to Uninstall:</strong><br>- Upgrading to a new update of the same season's tools (e.g., 2024.1.0 to 2024.1.1)<br><br><strong>Uninstallation Process:</strong><br>1. Open Windows Settings (Start → Settings)<br>2. Go to Apps → Apps & features<br>3. Search for \"NI Software\"<br>4. Select and click Uninstall<br>5. In the dialog box, select all entries (easiest: deselect \"Products Only\" checkbox, then select the checkbox next to \"Name\")<br>6. Click Remove<br>7. Wait for uninstaller to complete<br>8. Reboot if prompted<br><br><strong>Note:</strong> LabVIEW teams have already completed this step and should skip to the Installation section."
    },
    {
      "type": "text",
      "title": "Installation Process",
      "content": "Follow these steps to install the FRC Game Tools (including Driver Station):<br><br><strong>1. Extraction:</strong><br><strong>Online Installer:</strong> Run the downloaded executable file. Click Yes if a Windows Security prompt appears.<br><strong>Offline Installer (Windows 10+):</strong> Right-click on the downloaded ISO file and select \"Mount\". Run <code>install.exe</code> from the mounted ISO. Click Yes if a Windows Security prompt appears.<br><br><strong>2. NI Package Manager License:</strong> Accept the NI Package Manager License agreement and click Next.<br><br><strong>3. Disable Windows Fast Startup (Recommended):</strong> It's recommended to leave this screen as-is, as Windows Fast Startup can cause issues with the NI drivers required to image the roboRIO. Click Next.<br><br><strong>4. Review and Installation:</strong> Review what will be installed, accept license agreements, and proceed with installation. The installer will download and install all components.<br><br><strong>Important:</strong> The installer may prompt that .NET Framework 4.6.2 needs to be updated or installed. Follow prompts on-screen to complete this, including rebooting if requested, then resume the FRC Game Tools installation.<br><br><strong>5. Reboot:</strong> If prompted, select \"Reboot Now\" after closing any open programs to complete the installation."
    },
    {
      "type": "text",
      "title": "Initial Configuration",
      "content": "After installation, configure Driver Station with your team number and network settings.<br><br><strong>Setting Team Number:</strong><br>1. Open FRC Driver Station<br>2. Go to the Settings or Configuration tab<br>3. Enter your FRC team number (e.g., 1234)<br>4. Save the settings<br><br><strong>Network Configuration:</strong> Driver Station uses your team number to determine the robot's IP address. The robot's IP address follows the pattern: <code>10.TE.AM.2</code> (where TE.AM is your team number split into two pairs). For example, team 1234 uses IP <code>10.12.34.2</code>.<br><br><strong>Radio Configuration:</strong> If using a wireless radio, you may need to configure radio settings. Most teams use the default settings, but check your radio documentation if needed."
    },
    {
      "type": "text",
      "title": "Driver Station Interface Overview",
      "content": "The Driver Station interface consists of several tabs and panels that provide different functionality.<br><br><strong>Main Window Components:</strong><br>- <strong>Status Bar:</strong> Shows connection status, robot state, and match information<br>- <strong>Mode Buttons:</strong> Buttons to switch between robot modes<br>- <strong>Tabs:</strong> Different views (Basic, Advanced, Logs, etc.)<br>- <strong>Telemetry Display:</strong> Shows data sent from robot code<br>- <strong>Camera View:</strong> Displays camera streams from robot<br><br><strong>Status Indicators:</strong> Color-coded indicators show robot status:<br>- <strong>Green:</strong> Robot connected and ready<br>- <strong>Yellow:</strong> Robot connected but issues detected<br>- <strong>Red:</strong> Robot not connected or error state<br>- <strong>Gray:</strong> Robot disabled or not responding"
    },
    {
      "type": "text",
      "title": "Robot Modes",
      "content": "The Driver Station controls four distinct robot modes, each serving a different purpose during robot operation.<br><br><strong>Disabled Mode:</strong><br>- Robot code is loaded but not running<br>- Motors and actuators are disabled<br>- Sensors can still be read<br>- Used when robot is not in use or during setup<br><br><strong>Autonomous Mode:</strong><br>- Robot runs pre-programmed autonomous code<br>- Typically runs for 15 seconds at match start<br>- Robot operates without driver input<br>- Used for autonomous routines<br><br><strong>Teleoperated Mode (Teleop):</strong><br>- Robot responds to driver input from joysticks/gamepads<br>- Runs for the remainder of the match after autonomous<br>- Primary mode for driver control<br>- Used for driver-controlled operation<br><br><strong>Test Mode:</strong><br>- Special mode for testing and calibration<br>- Allows running test code<br>- Useful for debugging and tuning<br>- Used for development and testing"
    },
    {
      "type": "code",
      "title": "Robot Mode Methods in Code",
      "content": "\npublic class Robot extends TimedRobot {\n    @Override\n    public void robotInit() {\n    }\n\n    @Override\n    public void disabledInit() {\n    }\n\n    @Override\n    public void disabledPeriodic() {\n    }\n\n    @Override\n    public void autonomousInit() {\n    }\n\n    @Override\n    public void autonomousPeriodic() {\n    }\n\n    @Override\n    public void teleopInit() {\n    }\n\n    @Override\n    public void teleopPeriodic() {\n    }\n\n    @Override\n    public void testInit() {\n    }\n\n    @Override\n    public void testPeriodic() {\n    }\n}"
    },
    {
      "type": "text",
      "title": "Communication Setup",
      "content": "Driver Station communicates with the robot over a network connection. Setting up communication correctly is essential for robot operation.<br><br><strong>Network Connection Types:</strong><br><br><strong>1. USB Connection:</strong><br>- Direct USB cable from computer to roboRIO<br>- Simplest connection method<br>- Used for initial setup and testing<br>- Limited range (cable length)<br><br><strong>2. Ethernet Connection:</strong><br>- Wired Ethernet connection<br>- More reliable than wireless<br>- Used in pit and practice field<br>- Requires Ethernet cable<br><br><strong>3. Wireless Connection:</strong><br>- Radio connection to robot<br>- Required for competition matches<br>- Uses team number for IP configuration<br>- Requires proper radio setup<br><br><strong>Verifying Connection:</strong> When Driver Station connects to the robot, you'll see connection status indicators turn green. The robot's IP address and status will be displayed."
    },
    {
      "type": "text",
      "title": "Using Driver Station",
      "content": "Once Driver Station is configured and connected, you can use it to control and monitor your robot.<br><br><strong>Starting Robot Code:</strong><br>1. Ensure robot is powered on<br>2. Deploy code to robot (if not already deployed)<br>3. Driver Station should automatically detect the robot<br>4. Connection status should show green<br><br><strong>Switching Modes:</strong><br>- Click the mode buttons (Disabled, Autonomous, Teleop, Test)<br>- Or use keyboard shortcuts if configured<br>- Robot code will transition to the selected mode<br><br><strong>Viewing Telemetry:</strong><br>- Telemetry data sent from robot code appears in the Driver Station<br>- Use SmartDashboard.put methods in your code to send data<br>- Telemetry updates in real-time<br><br><strong>Reading Logs:</strong><br>- Switch to the Logs tab to view robot code output<br>- Useful for debugging and monitoring<br>- Shows System.out.println() and error messages"
    },
    {
      "type": "text",
      "title": "Advanced Features",
      "content": "Driver Station includes several advanced features for enhanced robot control and monitoring.<br><br><strong>Camera Streaming:</strong><br>- View camera feeds from robot-mounted cameras<br>- Multiple camera support<br>- Useful for driver vision and autonomous navigation<br>- Configure in robot code using WPILib camera classes<br><br><strong>Joystick Configuration:</strong><br>- Configure joystick and gamepad mappings<br>- Calibrate joystick axes<br>- Test joystick inputs<br>- Useful for driver preference setup<br><br><strong>Match Timer:</strong><br>- Displays match countdown timer<br>- Shows time remaining in autonomous and teleop<br>- Syncs with FMS during competitions<br>- Helps drivers manage match time<br><br><strong>FMS Integration:</strong><br>- Field Management System integration during competitions<br>- Automatic match start/stop<br>- Receives match data from FMS<br>- Competition-specific feature"
    },
    {
      "type": "text",
      "title": "Emergency Stop",
      "content": "The Emergency Stop (E-Stop) is a critical safety feature that immediately stops all robot movement.<br><br><strong>How to E-Stop:</strong><br>- Click the large red E-Stop button in Driver Station<br>- Or press the physical E-Stop button on the robot (if equipped)<br><br><strong>What E-Stop Does:</strong><br>- Immediately stops all motors and actuators<br>- Disables robot code execution<br>- Requires manual reset to resume operation<br><br><strong>When to Use:</strong><br>- Robot is moving unexpectedly<br>- Safety hazard detected<br>- Robot needs immediate stopping<br><br><strong>Resetting E-Stop:</strong> After E-Stopping, you must manually reset the E-Stop before the robot can operate again. This is a safety feature to prevent accidental resumption."
    },
    {
      "type": "text",
      "title": "Competition Workflow",
      "content": "During competitions, Driver Station usage follows a specific workflow:<br><br><strong>Pre-Match:</strong><br>1. Power on robot<br>2. Connect Driver Station to robot<br>3. Verify connection and robot status<br>4. Check that correct code is deployed<br>5. Test basic robot functions<br><br><strong>Match Start:</strong><br>1. FMS automatically starts match timer<br>2. Autonomous mode begins automatically<br>3. Monitor robot during autonomous<br>4. Transition to teleop when autonomous ends<br><br><strong>During Match:</strong><br>1. Monitor robot status and telemetry<br>2. Watch for connection issues<br>3. Use E-Stop if safety issue arises<br>4. Track match time remaining<br><br><strong>Post-Match:</strong><br>1. Robot automatically enters disabled mode<br>2. Review telemetry and logs if needed<br>3. Prepare for next match"
    },
    {
      "type": "link-grid",
      "title": "Related Topics and Documentation",
      "links": [
        {
          "label": "Elastic Basics",
          "id": "elastic-basics"
        },
        {
          "label": "Project Creation",
          "id": "project-creation"
        },
        {
          "label": "WPILib Setup",
          "id": "wpilib-setup"
        }
      ]
    }
  ]
}