{
  "title": "WPILib Setup and Installation",
  "sections": [
    {
      "type": "text",
      "title": "Introduction to WPILib",
      "content": "WPILib (Worcester Polytechnic Institute Library) is the official programming framework for FRC robots. It provides a comprehensive set of tools, libraries, and templates for robot programming in Java, C++, and Python. WPILib abstracts away low-level hardware details, allowing you to focus on robot logic and control algorithms.<br><br>WPILib is maintained by FIRST and is updated annually for each competition season. It includes everything you need to program FRC robots, from motor controllers to sensors to advanced control systems."
    },
    {
      "type": "rules-box",
      "title": "What WPILib Provides",
      "subtitle": "The WPILib installer includes:",
      "items": [
        "WPILib libraries for robot programming",
        "Java Development Kit (JDK) for Java development",
        "Gradle build system for compiling and deploying code",
        "Visual Studio Code with WPILib extension",
        "FRC Driver Station software",
        "FRC utilities and tools",
        "Vendor library support (CTRE, REV, etc.)"
      ]
    },
    {
      "type": "text",
      "title": "System Requirements",
      "content": "Before installing WPILib, ensure your computer meets these requirements:<br><br><strong>Operating System:</strong> Windows 10/11, macOS 10.14+, or Linux (Ubuntu 18.04+ recommended)<br><strong>Disk Space:</strong> At least 5 GB free space for installation<br><strong>Internet Connection:</strong> Required for downloading and updating components<br><strong>Administrator Access:</strong> May be required for some installation steps<br><br>Note: WPILib includes its own Java installation, so you don't need to install Java separately. However, if you have Java installed, make sure it's compatible with the WPILib version you're installing."
    },
    {
      "type": "text",
      "title": "Downloading WPILib",
      "content": "The WPILib installer is available from the official WPILib releases page. Each season has its own version of WPILib, so make sure you download the correct version for your competition season.<br><br><strong>Download Locations:</strong><br><a href='https://github.com/wpilibsuite/allwpilib/releases' target='_blank'>WPILib Releases on GitHub</a><br><a href='https://docs.wpilib.org/en/stable/docs/zero-to-robot/step-2/wpilib-setup.html#downloading' target='_blank'>WPILib Download via Official Documentation</a><br><br>Look for the latest release for your season (e.g., '2024.1.1' for the 2024 season). Download the installer appropriate for your operating system:<br>- Windows: <code>WPILibInstaller_Windows.exe</code><br>- macOS: <code>WPILibInstaller_macOS.dmg</code><br>- Linux: <code>WPILibInstaller_Linux.tar.gz</code>"
    },
    {
      "type": "text",
      "title": "Installation Process",
      "content": "Please follow the instructions in the <a href='https://docs.wpilib.org/en/stable/docs/zero-to-robot/step-2/wpilib-setup.html' target='_blank'>WPILib Documentation: WPILib Installation Guide</a> to install WPILib."
    },
    {
      "type": "text",
      "title": "Installation Directory Structure",
      "content": "After installation, WPILib creates a directory structure on your computer. Understanding this structure helps when troubleshooting or manually configuring components.<br><br><strong>Default Installation Locations:</strong><br>- <strong>Windows:</strong> <code>C:\\Users\\Public\\wpilib\\[year]</code><br>- <strong>macOS:</strong> <code>~/wpilib/[year]</code><br>- <strong>Linux:</strong> <code>~/wpilib/[year]</code><br><br>Within this directory, you'll find:<br>- <code>java/</code> - Java libraries and dependencies<br>- <code>tools/</code> - FRC utilities and tools<br>- <code>gradle/</code> - Gradle wrapper and build tools<br><br>Your projects will typically be stored in a separate location of your choice."
    },
    {
      "type": "rules-box",
      "title": "Installed Components Explained",
      "subtitle": "What each component does:",
      "items": [
        "<strong>WPILib Libraries:</strong> Core Java classes for robot programming (motors, sensors, control systems)",
        "<strong>Java Development Kit (JDK):</strong> Required to compile and run Java code",
        "<strong>Gradle Build System:</strong> Manages dependencies and builds your robot code",
        "<strong>Visual Studio Code:</strong> Code editor with WPILib extension for FRC development",       "<strong>FRC Game Tools:</strong> Utilities for robot configuration and testing"
      ]
    },
    {
      "type": "text",
      "title": "Verifying Installation",
      "content": "After installation, verify that WPILib is correctly installed:<br><br><strong>1. Check VS Code:</strong> Open Visual Studio Code. You should see the WPILib extension installed. You can verify this by going to Extensions (Ctrl+Shift+X) and searching for 'WPILib'.<br><br><strong>2. Check Command Palette:</strong> In VS Code, press Ctrl+Shift+P (Cmd+Shift+P on Mac) and type 'WPILib'. You should see WPILib commands available.<br><br><strong>3. Check Installation Directory:</strong> Navigate to the WPILib installation directory and verify that the folders and files are present.<br><br><strong>4. Test Project Creation:</strong> Try creating a new WPILib project (covered in the next lesson) to ensure everything works correctly."
    },
    {
      "type": "text",
      "title": "Updating WPILib",
      "content": "WPILib is updated throughout the season with bug fixes and new features. It's important to keep your installation up to date.<br><br><strong>Checking for Updates:</strong><br>1. Visit the <a href='https://github.com/wpilibsuite/allwpilib/releases' target='_blank'>WPILib Releases page</a><br>2. Check if a newer version is available<br>3. Download and run the new installer<br><br><strong>Updating Process:</strong> The update process is similar to the initial installation. Run the new installer, and it will update your existing installation. Your projects should continue to work, but you may need to update your project's WPILib version in <code>build.gradle</code>.<br><br><strong>Season Updates:</strong> Each new FRC season requires a new version of WPILib. You'll need to install the new season's version and update your projects accordingly."
    },
    {
      "type": "text",
      "title": "WPILib Versioning",
      "content": "WPILib uses semantic versioning (major.minor.patch) and is tied to FRC seasons. Understanding version numbers helps ensure compatibility:<br><br><strong>Version Format:</strong> <code>[Year].[Major].[Minor]</code> (e.g., 2024.1.1)<br>- <strong>Year:</strong> The FRC competition season<br>- <strong>Major:</strong> Major feature releases during the season<br>- <strong>Minor:</strong> Bug fixes and minor updates<br><br><strong>Season Compatibility:</strong> Each FRC season has its own WPILib version. Code written for one season's WPILib may not be compatible with another season's version. Always use the WPILib version that matches your competition season.<br><br>Learn more: <a href='https://docs.wpilib.org/en/stable/docs/software/getting-started/index.html' target='_blank'>WPILib Getting Started Guide</a>"
    },
    {
      "type": "rules-box",
      "title": "Troubleshooting Common Issues",
      "subtitle": "If you encounter problems:",
      "items": [
        "<strong>Installation Fails:</strong> Ensure administrator privileges and sufficient disk space",
        "<strong>VS Code Extension Not Found:</strong> Manually install WPILib extension from VS Code marketplace",
        "<strong>Java Not Found:</strong> Check installation directory, installer should install Java automatically",
        "<strong>Gradle Errors:</strong> Ensure Gradle wrapper is properly installed in your project",
        "<strong>Network Issues:</strong> Check firewall settings, some components require internet access",
        "<strong>Permission Errors:</strong> On Linux/Mac, make installer executable with chmod +x",
        "<strong>Components Missing:</strong> Re-run installer, ensure all components are selected",
        "<strong>Version Conflicts:</strong> Uninstall old WPILib versions before installing new season"
      ]
    },
    {
      "type": "text",
      "title": "Component Dependencies",
      "content": "WPILib components have dependencies on each other. Understanding these relationships helps when troubleshooting:<br><br><strong>WPILib Libraries</strong> depend on:<br>- Java Development Kit (JDK)<br>- Gradle build system<br><br><strong>VS Code Extension</strong> depends on:<br>- Visual Studio Code<br>- WPILib libraries (for IntelliSense and code completion)"
    },
    {
      "type": "text",
      "title": "Next Steps",
      "content": "Once WPILib is installed and verified, you're ready to create your first FRC robot project. The next lesson will guide you through creating a new project using WPILib templates."
    },
    {
      "type": "link-grid",
      "title": "Related Topics",
      "links": [
        { "label": "Project Creation", "id": "project-creation" },
        { "label": "VS Code Setup", "id": "vs-code-setup" },
        { "label": "Gradle Build System", "id": "gradle-build-system" }
      ]
    }
  ]
}

