{
  "id": "landing-page",
  "title": "Welcome to FRCJava - FRC Programming Fundamentals",
  "sections": [
    {
      "type": "text",
      "title": "Explore Java Programming for FRC Robotics",
      "content": "This training module is designed to introduce you to the fundamentals of Java programming, with a special focus on its application in FRC (FIRST Robotics Competition) robotics. Whether you're a beginner or looking to refresh your knowledge, you'll find comprehensive lessons covering core Java concepts and how they translate into controlling a robot."
    },
    {
      "type": "text",
      "title": "What You'll Learn:",
      "content": "<ul>\n  <li><strong>Java Basics:</strong> Variables, data types, operators, and basic input/output.</li>\n  <li><strong>Programming Logic:</strong> Conditional statements, methods, control structures, and error handling.</li>\n  <li><strong>Loops:</strong> Efficiently repeating code with while and for loops.</li>\n  <li><strong>Object-Oriented Programming (OOP):</strong> Classes, objects, and key OOP principles.</li>\n  <li><strong>FRC Specific Programming:</strong> Introduction to WPILib, motors, and command-based programming.</li>\n</ul>"
    },
    {
      "type": "link-grid",
      "title": "Start Your Journey Here:",
      "links": [
        {
          "label": "Java Basics",
          "id": "java-basics"
        },
        {
          "label": "Programming Logic",
          "id": "programming-logic"
        },
        {
          "label": "Loops",
          "id": "loops"
        },
        {
          "label": "Object-Oriented Programming",
          "id": "object-oriented"
        },
        {
          "label": "FRC Specific Programming",
          "id": "frc-specific"
        }
      ]
    },
    {
        "type": "text",
        "title": "How to Use This Resource:",
        "content": "Navigate through the tabs on the left to explore different topics. Each section includes explanations, code examples, and often exercises to help you practice what you've learned. We recommend going through the sections in order, especially if you are new to Java. If you have prior experience, feel free to jump to specific topics that interest you."
      }  
]
}