{
    "id": "pid",
    "title": "PID Control and Motion Magic in FRC",
    "sections": [
      {
        "type": "text",
        "title": "Understanding PID Control",
        "content": "PID (Proportional-Integral-Derivative) control is a widely used feedback loop mechanism in control systems. It continuously calculates an error value as the difference between a desired setpoint and a measured process variable and applies a correction based on proportional, integral, and derivative terms.  Think of it like this: imagine you're trying to reach a specific temperature in a room with a heater.  You want to keep the room at exactly 72 degrees. PID control uses three main terms to achieve precise and stable control:"
      },
      {
        "type": "rules-box",
        "items": [
        "<b>Proportional (P) Term:</b> Produces a control action proportional to the current error. A higher P gain results in a stronger response to the current error, causing the system to react more quickly — for example, if the room is 10 degrees below the setpoint, a higher P gain will make the heater work harder. However, using only a P term can lead to overshoot (going past the setpoint) and steady-state error (never quite reaching the setpoint).",
        "<b>Integral (I) Term:</b> Addresses the accumulated error over time. Even a small, persistent error will eventually trigger a significant control action from the I term. If the room consistently stays slightly below the setpoint, the I term gradually increases the heater's output to eliminate steady-state error. A higher I gain reduces steady-state error but can also increase overshoot and oscillations.",
        "<b>Derivative (D) Term:</b> Reacts to the rate of change of the error, predicting future error and dampening oscillations by applying a control action based on how quickly the error is changing. For instance, if the room temperature is rising rapidly, the D term will anticipate overshoot and reduce the heater's output to smooth the response. A higher D gain improves stability and reduces overshoot, but excessive D gain can make the system sluggish or overly sensitive to noise."
        ]
      },
      {
        "type": "text",
        "content": "These three terms work together to produce a control output that quickly reaches the setpoint, minimizes overshoot, and eliminates steady-state error."
      }
      ]
      }  