{
  "title": "Introduction to REV Robotics Hardware",
  "sections": [
    {
      "type": "text",
      "title": "What is REV Robotics?",
      "content": "REV Robotics is a leading manufacturer of motor controllers, motors, sensors, and other electronics for FRC robots. REV products are widely used in FRC due to their reliability, ease of use, and excellent documentation. Understanding REV hardware is essential for many FRC teams.<br><br>REV provides a comprehensive ecosystem of hardware and software tools that work together seamlessly. Their products are designed specifically for FRC competition and are well-documented and supported.<br><br><strong>Learn more:</strong> <a href='https://docs.revrobotics.com/docs/ion/' target='_blank'>REV ION Documentation</a>"
    },
    {
      "type": "rules-box",
      "title": "REV Product Lineup",
      "subtitle": "Main REV products for FRC:",
      "items": [
        "<strong>SPARK MAX:</strong> CAN-based motor controller supporting both brushed and brushless DC motors with advanced control features",
        "<strong>SPARK Flex:</strong> Enhanced motor controller with improved performance and additional features for high-power applications",
        "<strong>NEO Brushless Motor:</strong> High-performance brushless motor with integrated encoder designed for FRC competition",
        "<strong>NEO 550 Motor:</strong> Compact brushless motor variant suitable for smaller mechanisms and applications",
        "<strong>REV Color Sensor V3:</strong> Advanced color detection sensor with proximity sensing capabilities",
        "<strong>REV 2m Distance Sensor:</strong> Ultrasonic distance sensor for object detection and ranging",
        "<strong>REV Pneumatic Hub:</strong> CAN-based pneumatic control module for managing solenoids and compressors",
        "<strong>REV Power Distribution Hub:</strong> Centralized power distribution system with circuit breakers and CAN bus integration"
      ]
    },
    {
      "type": "text",
      "title": "REVLib Software Library",
      "content": "REVLib is the software library that provides Java APIs for controlling REV hardware. It's built on top of WPILib and integrates seamlessly with the FRC development environment.<br><br><strong>Key Features:</strong><br>- CAN bus communication for all devices<br>- Advanced motor control (PID, Smart Motion)<br>- Sensor integration and data processing<br>- Configuration persistence<br>- Status monitoring and diagnostics<br><br>REVLib is actively maintained and updated for each FRC season, ensuring compatibility with the latest WPILib versions."
    },
    {
      "type": "text",
      "title": "When to Use REV Hardware",
      "content": "REV hardware is an excellent choice for many FRC applications. Here are situations where REV products excel:<br><br><strong>SPARK MAX Advantages:</strong><br>- Easy to use and configure<br>- Supports both brushed and brushless motors<br>- Built-in encoder support (NEO motors)<br>- Advanced motion profiling (Smart Motion)<br>- Excellent documentation and community support<br><br><strong>NEO Motor Advantages:</strong><br>- High performance and efficiency<br>- Integrated encoder (no external encoder needed)<br>- Reliable and proven in competition<br>- Good value for performance<br><br><strong>REV Sensor Advantages:</strong><br>- Easy integration via data port<br>- Well-documented APIs<br>- Reliable performance<br>- Useful for autonomous and teleop"
    },
    {
      "type": "text",
      "title": "Installing REVLib (Online Method)",
      "content": "The online installation method fetches the latest library version directly from the internet. This is the simplest method if you have internet access.<br><br><strong>Steps:</strong><br>1. In Visual Studio Code, press <code>Ctrl+Shift+P</code> (or <code>Cmd+Shift+P</code> on Mac) to open the Command Palette<br>2. Type \"WPILib: Manage Vendor Libraries\" and select it<br>3. Choose \"Install new libraries (online)\"<br>4. Enter the URL for the REVLib vendordeps JSON file:<br>   <code>https://www.revrobotics.com/content/sw/max/sdk/REVLib.json</code><br>5. VS Code will download and configure the library automatically<br>6. Your Gradle project will sync automatically<br><br>The library will be added to your project's <code>vendordeps/</code> folder, and all dependencies and repositories will be configured automatically."
    },
    {
      "type": "text",
      "title": "Installing REVLib (Offline Method)",
      "content": "The offline installation method uses a vendordeps JSON file that you can download and add to your project manually.<br><br><strong>Steps:</strong><br>1. Download the REVLib vendordeps JSON file from the <a href='https://github.com/REVrobotics/SPARK-MAX-Examples' target='_blank'>REV Robotics GitHub</a> or <a href='https://www.revrobotics.com/sparkmax-software/' target='_blank'>REV Robotics website</a><br>2. Place the JSON file in your project's <code>vendordeps/</code> folder<br>3. In Visual Studio Code, press <code>Ctrl+Shift+P</code> (or <code>Cmd+Shift+P</code> on Mac) to open the Command Palette<br>4. Type \"WPILib: Manage Vendor Libraries\" and select it<br>5. Choose \"Install new libraries (offline)\"<br>6. Select the REVLib library from the list<br>7. Click OK to add it to your project<br><br>The library will be added to your project, and all dependencies will be configured automatically."
    },
    {
      "type": "text",
      "title": "Checking for Updates",
      "content": "It's important to keep your vendor libraries up to date to ensure compatibility with the latest WPILib version and to receive bug fixes and new features.<br><br><strong>Checking for Updates (Offline):</strong><br>1. Open the Command Palette (<code>Ctrl+Shift+P</code> or <code>Cmd+Shift+P</code>)<br>2. Type \"WPILib: Manage Vendor Libraries\" and select it<br>3. Choose \"Check for updates (offline)\"<br>4. VS Code will check for newer versions in your system's vendordeps directory<br><br><strong>Checking for Updates (Online):</strong><br>1. Open the Command Palette<br>2. Type \"WPILib: Manage Vendor Libraries\" and select it<br>3. Choose \"Check for updates (online)\"<br>4. VS Code will fetch the latest version from the internet if the vendordeps JSON includes an update URL<br><br><strong>Best Practice:</strong> Check for updates periodically, especially at the start of a new FRC season or when updating WPILib."
    },
    {
      "type": "text",
      "title": "REVLib API Structure",
      "content": "REVLib provides a comprehensive Java API for controlling REV hardware. Understanding the API structure helps you work effectively with REV devices.<br><br><strong>REVLib Main Packages:</strong><br>- <code>com.revrobotics</code> - Core classes and interfaces<br>- <code>com.revrobotics.CANSparkMax</code> - SPARK MAX motor controller class<br>- <code>com.revrobotics.CANSparkLowLevel</code> - Low-level control classes<br>- <code>com.revrobotics.SparkPIDController</code> - PID control classes<br>- <code>com.revrobotics.SparkMaxAlternateEncoder</code> - External encoder support<br>- <code>com.revrobotics.ColorSensorV3</code> - Color sensor class<br>- <code>com.revrobotics.REVLibError</code> - Error handling<br><br>REVLib integrates seamlessly with WPILib's command-based framework and other WPILib features."
    },
    {
      "type": "code",
      "title": "Basic REVLib Import Structure",
      "content": "// SPARK MAX motor controller\nimport com.revrobotics.CANSparkMax;\nimport com.revrobotics.CANSparkLowLevel.MotorType;\n\n// PID control\nimport com.revrobotics.SparkPIDController;\nimport com.revrobotics.CANSparkBase.ControlType;\n\n// Encoders\nimport com.revrobotics.RelativeEncoder;\nimport com.revrobotics.AbsoluteEncoder;\nimport com.revrobotics.SparkMaxAlternateEncoder;\n\n// Sensors\nimport com.revrobotics.ColorSensorV3;\nimport com.revrobotics.ColorMatch;\n\n// Configuration\nimport com.revrobotics.SparkBase.IdleMode;\n\n// Error handling\nimport com.revrobotics.REVLibError;\n\n// WPILib integration\nimport edu.wpi.first.wpilibj.motorcontrol.MotorController;\nimport edu.wpi.first.wpilibj2.command.SubsystemBase;"
    },
    {
      "type": "text",
      "title": "REV Hardware Client",
      "content": "REV Hardware Client is REV's configuration and diagnostic tool. It's essential for setting up and tuning REV hardware.<br><br><strong>REV Hardware Client Capabilities:</strong><br>- Configure CAN IDs for all REV devices<br>- Set motor controller parameters<br>- Configure sensors<br>- Tune PID loops<br>- Monitor device status and diagnostics<br>- Update firmware<br>- Save and load configurations<br><br><strong>Download:</strong> REV Hardware Client is available from the <a href='https://www.revrobotics.com/rev-hardware-client/' target='_blank'>REV Robotics website</a>. It's a standalone application that connects to your robot over USB or CAN bus."
    },
    {
      "type": "text",
      "title": "CAN Bus Communication",
      "content": "REV devices communicate over the CAN (Controller Area Network) bus. Understanding CAN bus basics helps when working with REV hardware.<br><br><strong>CAN Bus Basics:</strong><br>- All devices share the same CAN bus<br>- Each device has a unique CAN ID (0-62)<br>- Devices communicate at high speed (1 Mbps)<br>- CAN bus is more reliable than PWM<br><br><strong>CAN ID Assignment:</strong><br>- Each REV device needs a unique CAN ID<br>- Set CAN IDs using REV Hardware Client or in code<br>- Common practice: Use sequential IDs (1, 2, 3, etc.)<br>- Document your CAN ID assignments<br><br><strong>CAN Bus Wiring:</strong><br>- Use proper CAN bus wiring (daisy-chain)<br>- Terminate the CAN bus at both ends (120 ohm resistors)<br>- Ensure proper power distribution"
    },
    {
      "type": "text",
      "title": "REV Related Topics and Documentation",
      "content": "REV provides comprehensive documentation for all their products. Here are key resources:<br><br><strong>Official Documentation:</strong><br>- <a href='https://docs.revrobotics.com/' target='_blank'>REV Robotics Documentation</a> - Complete product documentation and guides<br>- <a href='https://codedocs.revrobotics.com/java/' target='_blank'>REVLib Java API Documentation</a> - Complete API reference<br>- <a href='https://www.revrobotics.com/sparkmax-software/' target='_blank'>SPARK MAX Software</a> - Software downloads and resources<br><br><strong>Community Resources:</strong><br>- REV forums and community support<br>- FRC programming resources and examples<br>- Team code examples and tutorials"
    },
    {
      "type": "text",
      "title": "REV vs Other Vendors",
      "content": "FRC teams can choose from multiple hardware vendors. Understanding the differences helps make informed decisions.<br><br><strong>REV Advantages:</strong><br>- Easy to use and configure<br>- Excellent documentation and support<br>- Good value for performance<br>- Strong community support<br>- Proven reliability in competition<br><br><strong>Considerations:</strong><br>- May have fewer advanced features than some alternatives<br>- Learning curve for advanced features<br>- Requires REV Hardware Client for configuration<br><br><strong>Vendor Choice:</strong> Many successful teams use REV hardware. The choice often comes down to team preference, budget, and specific requirements. Some teams use a mix of vendors for different mechanisms."
    },
    {
      "type": "link-grid",
      "title": "Next Steps",
      "links": [
        {
		  "label": "SPARK MAX Setup", 
		  "id": "spark-max-setup"},
        {
		  "label": "Gradle Build System", 
		  "id": "gradle-build-system"},
        {
		  "label": "REV Hardware Client", 
		  "id": "rev-hardware-client"}
      ]
    }
  ]
}

