{
  "title": "REV Hardware Client",
  "sections": [
    {
      "type": "text",
      "title": "Introduction to REV Hardware Client",
      "content": "REV Hardware Client is REV Robotics' configuration and diagnostic tool for managing REV devices. It provides a graphical interface for configuring SPARK MAX controllers, updating firmware, and performing diagnostics. Understanding how to use REV Hardware Client is essential for setting up and maintaining REV hardware.<br><br>REV Hardware Client is similar to Phoenix Tuner for CTRE devices - it's the primary tool for device configuration and troubleshooting. It connects to your robot over USB or CAN bus and allows you to configure all device parameters."
    },
    {
      "type": "text",
      "title": "Installing REV Hardware Client",
      "content": "REV Hardware Client is a standalone application that you install on your computer. It's available for Windows, macOS, and Linux.<br><br><strong>Download:</strong> REV Hardware Client is available from the <a href='https://www.revrobotics.com/rev-hardware-client/' target='_blank'>REV Robotics website</a> or from the <a href='https://github.com/REVrobotics/REV-Hardware-Client/releases' target='_blank'>REV Hardware Client GitHub releases page</a>.<br><br><strong>Installation Steps:</strong><br>1. Download the installer for your operating system<br>2. Run the installer<br>3. Follow the installation wizard<br>4. Launch REV Hardware Client<br><br><strong>System Requirements:</strong> REV Hardware Client requires a computer with USB ports (for USB connection) or network connection (for CAN bus connection). Check REV documentation for specific system requirements."
    },
    {
      "type": "text",
      "title": "Connecting to Devices",
      "content": "REV Hardware Client can connect to REV devices in two ways:<br><br><strong>USB Connection:</strong><br>- Connect SPARK MAX to computer via USB cable<br>- REV Hardware Client automatically detects connected devices<br>- Useful for initial setup and configuration<br>- Fast and reliable connection<br><br><strong>CAN Bus Connection:</strong><br>- Connect to robot over network (robot must be powered and on network)<br>- REV Hardware Client scans CAN bus for REV devices<br>- Useful for configuring devices on robot<br>- Requires robot to be on same network<br><br><strong>Finding Devices:</strong><br>1. Open REV Hardware Client<br>2. Click \"Scan for Devices\" or \"Find Devices\"<br>3. REV Hardware Client will discover all REV devices<br>4. Select device from list to configure<br><br><strong>Connection Troubleshooting:</strong> If devices aren't found, check USB connection, verify robot is powered, check network connection, and ensure devices have valid CAN IDs."
    },
    {
      "type": "text",
      "title": "REV Hardware Client Interface",
      "content": "REV Hardware Client provides a user-friendly interface for device management:<br><br><strong>Main Window:</strong><br>- Device list showing all discovered REV devices<br>- Device selection and navigation<br>- Status indicators for each device<br><br><strong>Configuration Panels:</strong><br>- Multiple tabs for different configuration categories<br>- Real-time parameter editing<br>- Apply and save buttons<br><br><strong>Status Indicators:</strong><br>- Device connection status<br>- Firmware version<br>- Fault indicators<br>- Real-time data display<br><br><strong>Navigation:</strong> Select a device from the list to view and configure its parameters. Each device has multiple configuration tabs for different parameter categories."
    },
    {
      "type": "text",
      "title": "Device Configuration",
      "content": "REV Hardware Client allows you to configure all SPARK MAX parameters through a graphical interface:<br><br><strong>General Configuration:</strong><br>- CAN ID assignment<br>- Motor type (brushed/brushless)<br>- Motor inversion<br>- Idle mode (brake/coast)<br><br><strong>Current Configuration:</strong><br>- Smart current limit<br>- Secondary current limit<br>- Current limit settings<br><br><strong>Voltage Configuration:</strong><br>- Voltage compensation<br>- Voltage settings<br><br><strong>Encoder Configuration:</strong><br>- Encoder type<br>- Encoder settings<br>- Position conversion factors<br><br><strong>PID Configuration:</strong><br>- PID parameters (kP, kI, kD, kFF)<br>- PID slots<br>- Closed loop settings<br><br><strong>Smart Motion Configuration:</strong><br>- Max velocity<br>- Max acceleration<br>- Motion profile settings<br><br><strong>Applying Configuration:</strong> After configuring parameters, click \"Apply\" to save settings to the device. Configuration is stored in the device's non-volatile memory."
    },
    {
      "type": "text",
      "title": "Firmware Management",
      "content": "REV Hardware Client can check and update firmware on REV devices:<br><br><strong>Checking Firmware Versions:</strong><br>- REV Hardware Client displays current firmware version for each device<br>- Compare versions to determine if update is needed<br>- Check REV documentation for latest firmware versions<br><br><strong>Updating Firmware:</strong><br>1. Select device from list<br>2. Navigate to firmware section<br>3. Check for available updates<br>4. Download and install updates if available<br>5. Follow update wizard<br><br><strong>Firmware Compatibility:</strong><br>- Ensure firmware is compatible with REVLib version<br>- Check REV documentation for compatibility information<br>- Update REVLib if needed when updating firmware<br><br><strong>Best Practice:</strong> Keep firmware up to date to receive bug fixes and new features. However, test thoroughly after updating firmware."
    },
    {
      "type": "text",
      "title": "Diagnostics and Monitoring",
      "content": "REV Hardware Client provides real-time diagnostics and monitoring capabilities:<br><br><strong>Real-Time Data Monitoring:</strong><br>- Motor output (percent and voltage)<br>- Current draw<br>- Bus voltage<br>- Temperature<br>- Encoder position and velocity<br>- PID status and error<br><br><strong>Fault Detection:</strong><br>- Device fault indicators<br>- Fault code descriptions<br>- Fault history<br><br><strong>Status Information:</strong><br>- Device connection status<br>- CAN bus status<br>- Communication status<br>- Device health<br><br><strong>Data Logging:</strong><br>- Record device data over time<br>- Export data for analysis<br>- Useful for tuning and debugging<br><br><strong>Using Diagnostics:</strong> Monitor device status during operation to identify issues, verify configuration, and optimize performance."
    },
    {
      "type": "text",
      "title": "Managing Multiple Devices",
      "content": "REV Hardware Client can manage multiple SPARK MAX controllers simultaneously:<br><br><strong>Device List:</strong><br>- All discovered devices are shown in device list<br>- Each device shows CAN ID and status<br>- Select device to configure<br><br><strong>Bulk Configuration:</strong><br>- Configure multiple devices with same settings<br>- Useful for drivetrains with multiple motors<br>- Apply configuration to multiple devices at once<br><br><strong>Device Organization:</strong><br>- Devices are organized by CAN ID<br>- Use descriptive CAN IDs for easy identification<br>- Document device assignments<br><br><strong>Configuration Management:</strong> Save and load configurations for easy setup of multiple devices or for sharing configurations with team members."
    },
    {
      "type": "text",
      "title": "Saving and Loading Configurations",
      "content": "REV Hardware Client can save and load device configurations:<br><br><strong>Saving Configurations:</strong><br>- Save device configuration to file<br>- Useful for backup and version control<br>- Share configurations with team members<br>- Document device settings<br><br><strong>Loading Configurations:</strong><br>- Load saved configuration file<br>- Apply configuration to device<br>- Useful for restoring settings<br>- Quick setup of multiple devices<br><br><strong>Configuration Files:</strong><br>- Configuration files are typically JSON format<br>- Can be edited manually if needed<br>- Can be version controlled<br><br><strong>Best Practice:</strong> Save configurations for all devices and keep them in version control. This ensures you can restore settings if needed and share configurations with team members."
    },
    {
      "type": "link-grid",
      "title": "Related Topics",
      "links": [
        {
		  "label": "SPARK MAX Configuration", 
		  "url": "spark-max-configuration"},
        {
		  "label": "SPARK MAX Setup", 
		  "url": "spark-max-setup"},
        {
		  "label": "REV Introduction", 
		  "url": "rev-intro"}
      ]
    }
  ]
}

