{
  "title": "Introduction to Road Runner",
  "sections": [
    {
      "type": "text",
      "title": "What is Road Runner?",
      "content": "Road Runner is an advanced motion planning library designed for FTC robots. It allows your robot to follow complex paths and trajectories with high accuracy, making it possible to execute sophisticated autonomous routines. Road Runner is especially useful for teams looking to go beyond simple drive commands and achieve precise, repeatable movement."
    },
    {
      "type": "text",
      "title": "Why Use Road Runner?",
      "content": "While the standard FTC SDK provides basic movement capabilities, Road Runner enables advanced features like trajectory following, motion profiling, and smooth path planning. This is crucial for competitive teams aiming for consistent autonomous performance."
    },
    {
      "type": "text",
      "title": "How Road Runner Integrates with FTC Projects",
      "content": "Road Runner is designed to work alongside the FTC SDK. The easiest way to get started is to use the official quickstart project, which comes with Road Runner, FTC Dashboard, and tuning utilities pre-installed. You can also add Road Runner to your existing project by updating your Gradle files and copying over the necessary code."
    },
    {
      "type": "list",
      "title": "Getting Started with Road Runner",
      "content": [
        "Download the <a href=\"https://github.com/acmerobotics/road-runner-quickstart\" target=\"_blank\">Road Runner Quickstart</a> project or clone it using Git.",
        "Open the project in Android Studio.",
        "Familiarize yourself with the folder structure, especially the <code>TeamCode</code> directory.",
        "If adding to an existing project, follow the <a href=\"https://rr.brott.dev/docs/v1-0/installation/\" target=\"_blank\">official installation guide</a> to update your Gradle files and copy over the required files.",
        "Once set up, proceed to the tuning process to calibrate Road Runner for your robot."
      ]
    },
    {
      "type": "emphasis-box",
      "title": "Reference",
      "content": "For more details, see the <a href=\"https://rr.brott.dev/docs/v1-0/installation/\" target=\"_blank\">Road Runner Installation Guide</a>."
    }
  ]
}
