{
  "title": "Setting Up the Android Studio Environment for FTC",
  "sections": [
    {
      "type": "text",
      "title": "What is Android Studio?",
      "content": "Android Studio is the official integrated development environment (IDE) for Android app development. FTC teams use it to write, test, and deploy robot code in Java. It provides advanced tools for editing, debugging, and managing your robot code, making it the preferred choice for teams with prior Java experience. <br><br>Learn more: <a href=\"https://ftc-docs.firstinspires.org/en/latest/programming_resources/android_studio_java/Android-Studio-Tutorial.html\" target=\"_blank\">FTC Docs: Android Studio Programming Tutorial</a>"
    },
    {
      "type": "text",
      "title": "Why Use Android Studio for FTC?",
      "content": "Android Studio offers powerful features such as code completion, refactoring, integrated version control, and advanced debugging. These tools help teams write robust, maintainable code and collaborate effectively. Android Studio is recommended for advanced users with Java experience, as it provides more flexibility and control than OnBot Java or Blocks."
    },
    {
      "type": "text",
      "title": "System Requirements",
      "content": "Before installing Android Studio, ensure your computer meets the minimum requirements. Android Studio requires a modern processor, at least 8GB of RAM (16GB recommended), and several gigabytes of free disk space. For the latest requirements, see the <a href=\"https://developer.android.com/studio\" target=\"_blank\">Android Studio Official Site</a>."
    },
    {
      "type": "text",
      "title": "Installing Android Studio",
      "content": "1. Download the installer from the <a href=\"https://developer.android.com/studio\" target=\"_blank\">Android Studio website</a>.<br>2. Run the installer and follow the setup wizard.<br>3. During installation, select the default options unless your team has specific requirements.<br>4. After installation, launch Android Studio to complete the initial setup.<br>5. For a more detalied guide, see <a href=\"https://ftc-docs.firstinspires.org/en/latest/programming_resources/android_studio_java/install/install.html\" target=\"_blank\">FTC Docs: Android Studio Programming Tutorial</a>."
    },
    {
      "type": "text",
      "title": "What is the Android SDK?",
      "content": "The Android Software Development Kit (SDK) provides the libraries and tools needed to build, test, and run Android apps—including FTC robot code. Without the SDK, Android Studio cannot compile or deploy your code to the Robot Controller. <br><br>Learn more: <a href=\"https://developer.android.com/studio\" target=\"_blank\">Android Studio Official Site</a>"
    },
    {
      "type": "text",
      "title": "Why Do FTC Teams Need the SDK?",
      "content": "FTC robots run on Android devices, so your code must be built using the Android SDK. The SDK ensures your code is compatible with the Robot Controller app and the Android operating system. Essentially, when you push your code to the robot, you are downloading the FTCRobotController app to the Control Hub. As such, it is often helpful to physically connect your Drive Hub to your computer via USB to maintain the WiFI connection between your computer and the Control Hub."
    },
    {
      "type": "text",
      "title": "Installing the SDK via Android Studio",
      "content": "When you first install Android Studio, it will prompt you to install the Android SDK. Always use the recommended settings. If you skipped this step, you can install the SDK later using the SDK Manager.<br><br>To open the SDK Manager: <ul><li>Go to <b>Tools > SDK Manager</b> in Android Studio.</li><li>Ensure you have the correct SDK version for FTC (usually API 25 or higher, but check the FTC Docs for the latest recommendation).</li></ul>"
    },
    {
      "type": "text",
      "title": "Managing SDK Tools and Updates",
      "content": "The SDK Manager also lets you update or install additional tools. Only update the SDK if your team is sure it will not break FTC compatibility. <br><br>For more information, see <a href=\"https://developer.android.com/studio/intro/update\" target=\"_blank\">Android Studio: Update the IDE and SDK Tools</a>."
    },
    {
      "type": "text",
      "title": "Downloading and Setting Up the FTC SDK Project",
      "content": "FTC teams use a special project called the FTC SDK. You can download it from the official <a href=\"https://github.com/FIRST-Tech-Challenge/FtcRobotController\" target=\"_blank\">FTC GitHub repository</a>. <br><br>To set up the project:<ul><li>Clone or download the repository to your computer.</li><li>Open Android Studio and select 'Open an existing project'.</li><li>Navigate to the folder where you saved the FTC SDK and open it.</li></ul>"
    },
    {
      "type": "text",
      "title": "High-Level Project Layout",
      "content": "The FTC SDK project is organized into modules and directories to separate your code from the official SDK. This structure helps you keep your code organized and makes it easier to update the SDK in the future. <br><br>For a visual overview, see <a href=\"https://ftc-docs.firstinspires.org/en/latest/programming_resources/android_studio_java/Android-Studio-Tutorial.html\" target=\"_blank\">FTC Docs: Android Studio Programming Tutorial</a>."
    },
    {
      "type": "text",
      "title": "Key Files and Directories",
      "content": "- <b>FtcRobotController</b>: Contains the official SDK code. Do not modify files here.<br>- <b>TeamCode</b>: This is where you write your own OpModes and custom classes.<br>- <b>build.gradle</b>: The build configuration file for each module.<br>- <b>AndroidManifest.xml</b>: Declares app permissions and components.<br>- <b>libs/</b>: Place any third-party libraries here if needed."
    },
    {
      "type": "text",
      "title": "Where to Write Your Code (TeamCode vs. FtcRobotController)",
      "content": "Always write your OpModes and custom code in the <b>TeamCode</b> module. This keeps your code separate from the SDK, making it easier to update the SDK and avoid conflicts. <br><br>To create a new OpMode, add a new Java class in <b>TeamCode/src/main/java/org/firstinspires/ftc/teamcode</b>."
    },
    {
      "type": "text",
      "title": "Gradle and Build System Basics",
      "content": "Gradle is the build system used by Android Studio. It compiles your code, manages dependencies, and packages your app for deployment. Most of the time, you won't need to edit Gradle files directly, but understanding the basics can help you troubleshoot build errors. <br><br>Learn more: <a href=\"https://docs.gradle.org/current/userguide/userguide.html\" target=\"_blank\">Gradle User Guide</a>"
    },
    {
      "type": "exercise-box",
      "title": "Practice Exercise: Creating Your First OpMode",
      "description": "Create a simple OpMode in Android Studio and deploy it to your Driver Hub.",
      "tasks": [
        "Open the FTC SDK project in Android Studio",
        "Navigate to TeamCode/src/main/java/org/firstinspires/ftc/teamcode",
        "Create a new Java class called 'MyFirstOpMode'",
        "Implement a basic LinearOpMode with telemetry output",
        "Build the project and deploy to your Driver Hub",
        "Test the OpMode on your robot"
      ]
    },
    {
      "type": "link-grid",
      "title": "Additional Resources",
      "description": "Essential resources for FTC Android Studio development",
      "links": [
        {
          "title": "FTC SDK GitHub Repository",
          "description": "Download the official FTC SDK and view source code",
          "url": "https://github.com/FIRST-Tech-Challenge/FtcRobotController"
        },
        {
          "title": "FTC Android Studio Tutorial",
          "description": "Official step-by-step guide for setting up Android Studio",
          "url": "https://ftc-docs.firstinspires.org/en/latest/programming_resources/android_studio_java/Android-Studio-Tutorial.html"
        },
        {
          "title": "FTC OpMode Documentation",
          "description": "Learn about OpMode types, lifecycle, and best practices",
          "url": "https://ftc-docs.firstinspires.org/en/latest/programming_resources/opmodes/index.html"
        },
        {
          "title": "Android Studio Official Site",
          "description": "Download Android Studio and access official documentation",
          "url": "https://developer.android.com/studio"
        }
      ]
    }
  ]
}
