{
  "title": "Installing the Android SDK for FTC Development",
  "sections": [
    {
      "type": "text",
      "title": "What is the Android SDK?",
      "content": "The Android Software Development Kit (SDK) provides the libraries and tools needed to build, test, and run Android apps—including FTC robot code. Without the SDK, Android Studio cannot compile or deploy your code to the Robot Controller. <br><br>Learn more: <a href=\"https://developer.android.com/studio\" target=\"_blank\">Android Studio Official Site</a>"
    },
    {
      "type": "text",
      "title": "Why Do FTC Teams Need the SDK?",
      "content": "FTC robots run on Android devices, so your code must be built using the Android SDK. The SDK ensures your code is compatible with the Robot Controller app and the Android operating system."
    },
    {
      "type": "text",
      "title": "Installing the SDK via Android Studio",
      "content": "When you first install Android Studio, it will prompt you to install the Android SDK. Always use the recommended settings. If you skipped this step, you can install the SDK later using the SDK Manager.<br><br>To open the SDK Manager: <ul><li>Go to <b>Tools > SDK Manager</b> in Android Studio.</li><li>Ensure you have the correct SDK version for FTC (usually API 25 or higher, but check the FTC Docs for the latest recommendation).</li></ul>"
    },
    {
      "type": "text",
      "title": "Managing SDK Tools and Updates",
      "content": "The SDK Manager also lets you update or install additional tools. Only update the SDK if your team is sure it will not break FTC compatibility. <br><br>For more information, see <a href=\"https://developer.android.com/studio/intro/update\" target=\"_blank\">Android Studio: Update the IDE and SDK Tools</a>."
    },
    {
      "type": "exercise-box",
      "title": "Practice Exercise",
      "description": "Check your Android Studio installation and verify the SDK is installed.",
      "tasks": [
        "Open Android Studio and launch the SDK Manager.",
        "Verify that the recommended SDK version for FTC is installed.",
        "If needed, install or update the SDK."
      ],
      "content": "If you are unsure which SDK version to use, consult the FTC Docs or ask your mentor."
    }
  ]
}
